InformationRegisters/РаботникиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>РаботникиОрганизаций</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтруктурноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсчислятьОППВ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СтатьяЗаконаОТрудеРК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияУвольненияИзОрганизации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ПричиныИзмененияСостояния.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ПричиныИзмененияСостояния</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПриемНаРаботу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Увольнение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ПодразделенияОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>ПодразделенияОрганизаций</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговыйКомитет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойВидДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УказыватьРеквизитыГоловнойОрганизации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯвляетсяСтруктурнымПодразделением</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестныйБюджет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетПоМестнымБюджетам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>pid</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>address</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>document_prefix</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>cato</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>created_at</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>updated_at</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>deleted_at</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ДолжностиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>ДолжностиОрганизаций</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/РаботникиОрганизаций/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Регистратор = Отбор.Регистратор.Значение;
	
	Запрос = Новый Запрос;
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	РаботникиОрганизаций.Сотрудник
				   |ПОМЕСТИТЬ ВТ_ВнешнийИсточник
	               |ИЗ
	               |	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	               |ГДЕ
	               |	РаботникиОрганизаций.Регистратор = &Регистратор";
				   
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		ДополнительныеСвойства.Вставить("МенеджерВТ", МенеджерВТ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Регистратор = Отбор.Регистратор.Значение;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Регистратор);

	СписокСотрудниковТекст = "";
	Если ДополнительныеСвойства.Свойство("МенеджерВТ")  Тогда
		
		Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.МенеджерВТ;
		
		СписокСотрудниковТекст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	СписокСотрудников.Сотрудник КАК Сотрудник
			|ПОМЕСТИТЬ ВТ_СписокСотрудников
			|ИЗ ВТ_ВнешнийИсточник КАК СписокСотрудников
			|
			|ОБЪЕДИНИТЬ  // Дополнять список будем только сотрудниками, которых еще нет
			|";
			
	КонецЕсли;
	
	ТаблицаНаборЗаписей = Выгрузить(,"Сотрудник, Период, ОбособленноеПодразделение, ПодразделениеОрганизации, СтруктурноеПодразделение, Должность, ПричинаИзмененияСостояния");
	
	Запрос.УстановитьПараметр("ТаблицаНаборЗаписей", ТаблицаНаборЗаписей);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Наборзаписей.Сотрудник,
		|	Наборзаписей.Период,
		|	Наборзаписей.ПодразделениеОрганизации,
		|	Наборзаписей.Должность,
		|	Наборзаписей.ОбособленноеПодразделение,
		|	Наборзаписей.СтруктурноеПодразделение,
		|	Наборзаписей.ПричинаИзмененияСостояния
		|ПОМЕСТИТЬ ВТ_НаборЗаписей
		|ИЗ &ТаблицаНаборЗаписей КАК НаборЗаписей
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|
		|" + СписокСотрудниковТекст + "
		|
		|ВЫБРАТЬ " + ?(СписокСотрудниковТекст = "", "РАЗЛИЧНЫЕ", "") + " 		
		|	НаборЗаписей.Сотрудник" + ?(СписокСотрудниковТекст = "", "
		|ПОМЕСТИТЬ ВТ_СписокСотрудников", "") + "
		|ИЗ
		|	ВТ_НаборЗаписей КАК НаборЗаписей
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СписокСотрудников.Сотрудник,
		|	НаборЗаписей.Период,
		|	НаборЗаписей.ПодразделениеОрганизации,
		|	НаборЗаписей.Должность,
		|	НаборЗаписей.ОбособленноеПодразделение,
		|	НаборЗаписей.СтруктурноеПодразделение,
		|	НаборЗаписей.ПричинаИзмененияСостояния
		|ПОМЕСТИТЬ ВТ_ДанныеПроведения
		|ИЗ
		|	ВТ_НаборЗаписей КАК НаборЗаписей
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СписокСотрудников КАК СписокСотрудников
		|		ПО НаборЗаписей.Сотрудник = СписокСотрудников.Сотрудник
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СписокСотрудников.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СписокСотрудников.Сотрудник,
		|	ЕСТЬNULL(ДанныеПриема.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПриемаНаРаботу,
		|	ЕСТЬNULL(ДанныеУвольнения.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаУвольнения,
		|	ВЫБОР
		|		КОГДА ДанныеПроведения.Сотрудник ЕСТЬ NULL 
		|			ТОГДА ЕСТЬNULL(АктуальныеДанные.ПодразделениеОрганизации, ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка))
		|		КОГДА НЕ АктуальныеДанные.Период ЕСТЬ NULL 
		|				И АктуальныеДанные.Период <= ДанныеПроведения.Период
		|			ТОГДА ДанныеПроведения.ПодразделениеОрганизации
		|		ИНАЧЕ ЕСТЬNULL(АктуальныеДанные.ПодразделениеОрганизации, ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка))
		|	КОНЕЦ КАК ТекущееПодразделениеОрганизации,
		|	ВЫБОР
		|		КОГДА ДанныеПроведения.Сотрудник ЕСТЬ NULL 
		|			ТОГДА ЕСТЬNULL(АктуальныеДанные.Должность, ЗНАЧЕНИЕ(Справочник.ДолжностиОрганизаций.ПустаяСсылка))
		|		КОГДА НЕ АктуальныеДанные.Период ЕСТЬ NULL 
		|				И АктуальныеДанные.Период <= ДанныеПроведения.Период
		|			ТОГДА ДанныеПроведения.Должность
		|		ИНАЧЕ ЕСТЬNULL(АктуальныеДанные.Должность, ЗНАЧЕНИЕ(Справочник.ДолжностиОрганизаций.ПустаяСсылка))
		|	КОНЕЦ КАК ТекущаяДолжностьОрганизации,
		|	ВЫБОР
		|		КОГДА ДанныеПроведения.Сотрудник ЕСТЬ NULL 
		|			ТОГДА ЕСТЬNULL(АктуальныеДанные.ОбособленноеПодразделение, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
		|		КОГДА НЕ АктуальныеДанные.Период ЕСТЬ NULL 
		|				И АктуальныеДанные.Период <= ДанныеПроведения.Период
		|			ТОГДА ДанныеПроведения.ОбособленноеПодразделение
		|		ИНАЧЕ ЕСТЬNULL(АктуальныеДанные.ОбособленноеПодразделение, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
		|	КОНЕЦ КАК ТекущаяСтруктурнаяЕдиница,
		|	ВЫБОР
		|		КОГДА ДанныеПроведения.Сотрудник ЕСТЬ NULL 
		|			ТОГДА ЕСТЬNULL(АктуальныеДанные.СтруктурноеПодразделение, ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка))
		|		КОГДА НЕ АктуальныеДанные.Период ЕСТЬ NULL 
		|				И АктуальныеДанные.Период <= ДанныеПроведения.Период
		|			ТОГДА ДанныеПроведения.СтруктурноеПодразделение
		|		ИНАЧЕ ЕСТЬNULL(АктуальныеДанные.СтруктурноеПодразделение, ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка))
		|	КОНЕЦ КАК ТекущееСтруктурноеПодразделение
		|ИЗ
		|	ВТ_СписокСотрудников КАК СписокСотрудников
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеПроведения КАК ДанныеПроведения
		|		ПО СписокСотрудников.Сотрудник = ДанныеПроведения.Сотрудник
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(
		|				,
		|				Сотрудник В
		|						(ВЫБРАТЬ
		|							СписокСотрудников.Сотрудник
		|						ИЗ
		|							ВТ_СписокСотрудников КАК СписокСотрудников)
		|					И ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу)) КАК ДанныеПриема
		|		ПО СписокСотрудников.Сотрудник = ДанныеПриема.Сотрудник
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(
		|				,
		|				Сотрудник В
		|						(ВЫБРАТЬ
		|							СписокСотрудников.Сотрудник
		|						ИЗ
		|							ВТ_СписокСотрудников КАК СписокСотрудников)
		|					И ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)) КАК ДанныеУвольнения
		|		ПО СписокСотрудников.Сотрудник = ДанныеУвольнения.Сотрудник
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(
		|				,
		|				Сотрудник В
		|					(ВЫБРАТЬ
		|						СписокСотрудников.Сотрудник
		|					ИЗ
		|						ВТ_СписокСотрудников КАК СписокСотрудников)) КАК АктуальныеДанные
		|		ПО СписокСотрудников.Сотрудник = АктуальныеДанные.Сотрудник
		|ГДЕ
		|	(ДанныеПроведения.Сотрудник ЕСТЬ NULL 
		|			ИЛИ (НЕ АктуальныеДанные.Период ЕСТЬ NULL 
		|				И АктуальныеДанные.Период <= ДанныеПроведения.Период)
		|			ИЛИ ДанныеПроведения.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу))
		|";
		
	Выборка = Запрос.Выполнить().Выбрать();
		
	Пока Выборка.Следующий() Цикл
		
		СотрудникОбъект = Выборка.Сотрудник.ПолучитьОбъект();
		
		Если СотрудникОбъект = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			СотрудникОбъект.Заблокировать();
		Исключение
			#Если ТолстыйКлиентОбычноеПриложение Тогда
				ОбщегоНазначенияБККлиентСервер.СообщитьОбОшибке(ИнформацияОбОшибке());
			# Иначе
				ОбщегоНазначенияБККлиентСервер.СообщитьОбОшибке(ИнформацияОбОшибке().Описание);
			# КонецЕсли
			Отказ = Истина;
			Продолжить;
		КонецПопытки;
		
		Если Отказ Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СотрудникОбъект, Выборка);
		
		СотрудникОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
